# Rdata03C.R: Part C for data transformation
# Jia-Sheng Heh, 11/15/2020,  revised from Rdata02.R

wkDir = "C:/Users/jsheh/Desktop/working/USC/AIbda/";   setwd(wkDir)
library(data.table)

########## (A).複習: 數據框轉換 (數據轉換的核心) ##########

#####===== (A1).(KDD1-2) 準備數據 (XXX2.csv-->X) =====#####
X = read.csv("XXX2.csv");   dim(X);   head(X,2)   #-- [1] 84008   9
#   invoiceNo channel customer product category price            datetime quantity amount category2   cost
# 1        N1      s1       c1      p1    kind1  1980 2015-01-07 20:07:11        1   1692      sub1 931.39
# 2        N2      s1       c2      p2    kind1  1400 2015-01-18 19:56:06        1   1197      sub2 793.36

#####===== (A2).(KDD3) SPC模型的數據轉換(X->Cv) =====#####
X$date = as.character(as.Date(X$datetime))
setDT(X, key=c("customer"))
Cv = X[, .(D0=min(date), Df=max(date), DD=length(unique(date)),
             FF=length(unique(invoiceNo)), MM=sum(amount), TT=sum(quantity)), by=customer ] 
dim(Cv);   head(Cv,2)   #-- [1] 7774    7
#    customer         D0         Df DD FF   MM TT
# 1:       c1 2015-01-07 2015-01-07  1  1 3335  3
# 2:      c10 2015-01-28 2015-01-28  1  1 2770  1
#-- D0: 首次來店日, Df: 最近來店日, DD: 來店日數
#-- FF交易次數,     MM: 交易金額,   TT: 購買商品數   

#####===== (A3).(KDD3) 客戶價值標籤/客戶價值模型(Cv$FF0,$MM0) =====#####
range(Cv$FF)   #--     1    11025
range(Cv$MM)   #-- -2400 18251044
Cv$FF0 = cut( Cv$FF, breaks=c(0,1,10,40,200,20000));  table(Cv$FF0)  
# (0,1]      (1,10]     (10,40]    (40,200] (200,2e+04] 
#  4169        3281         275          44           5 
Cv$MM0 = cut( Cv$MM, breaks=c(-5000,0,999,9999,99999,999999,19999999));   table(Cv$MM0)
# (-5e+03,0]       (0,999]   (999,1e+04] (1e+04,1e+05] (1e+05,1e+06] (1e+06,2e+07] 
#         20           937          5587          1193            33             4 
dim(Cv);   head(Cv,2)       #-- [1] 7774    9
#    customer         D0         Df DD FF   MM TT   FF0         MM0
# 1:       c1 2015-01-07 2015-01-07  1  1 3335  3 (0,1] (999,1e+04]
# 2:      c10 2015-01-28 2015-01-28  1  1 2770  1 (0,1] (999,1e+04]

########## (B).進一步的設計: 客戶進出模型 ##########
#####===== (B1).(KDD3) 客戶時間標籤的設計(Cv$Q0,$Qf) =====#####
Cv$Q0 = paste0(substr(Cv$D0,3,4), cut(as.integer(substr(Cv$D0,6,7)),breaks=c(0,3,6,9,12),labels=c("Q1","Q2","Q3","Q4")))
Cv$Qf = paste0(substr(Cv$Df,3,4), cut(as.integer(substr(Cv$Df,6,7)),breaks=c(0,3,6,9,12),labels=c("Q1","Q2","Q3","Q4")))

########## (C).進一步的設計: 客戶回購/流失模型 ##########
#####===== (C1).(KDD3) 客戶標籤的設計(Cv$FF0,$MM0,$BB0,$Q0,$Qf) =====#####
Cv$BB = (as.Date(Cv$Df)-as.Date(Cv$D0))/Cv$DD  #-- 平均回購週期
Cv$BB0 = cut( as.numeric(Cv$BB), breaks=c(-1,0,7,30,100,999));  table(Cv$BB0)
# (-1,0]     (0,7]    (7,30]  (30,100] (100,999] 
#   4544       482       712      1146       890 

########## (D).RMD文件(見Rdata3B.Rmd) ##########


########## (E).客戶圖像與客戶歷程 ##########

#####===== (E1).流失客數據檔 (write.csv())--客戶圖像(customer profile) =====#####
#-- 流失客: 三倍回購週期以上未出現者
Cvlost = Cv[((Cv$Qf=="17Q1")&(Cv$BB0=="(7,30]")),];   dim(Cvlost);   head(Cvlost,2)   #-- [1] 65 13
#    customer         D0         Df DD FF     MM  TT      FF0           MM0   Q0   Qf             BB    BB0
# 1:     c120 2015-01-09 2017-02-22 65 77 156539 113 (40,200] (1e+05,1e+06] 15Q1 17Q1 11.923077 days (7,30]
# 2:    c1529 2015-05-09 2017-03-04 71 83 164521 173 (40,200] (1e+05,1e+06] 15Q2 17Q1  9.366197 days (7,30]
write.csv( Cvlost, paste0(wkDir,"Cvlost.csv"), fileEncoding="Big5" )
#-- (A)數據框可以直接寫入.csv試算表檔案(.csv,意指Comma-Separated Values逗號分隔值)中
#-- (B).csv試算表檔案，當然也可以用 X = read.csv("Xnew.csv",fileEncoding="Big5") 讀進來
#-- (C)編碼要設定為 Big-5碼，才能由 EXCEL或 Power-BI 讀入
#-- (D)這是一種簡單的標籤檔(tag)

#####===== (E2).數據空間中的標籤回射(tag reflection) (Cv$Qf,Cv$BB0-->X) =====#####
X$Qf  = Cv$Qf[match(X$customer,Cv$customer)]
X$BB0 = Cv$BB0[match(X$customer,Cv$customer)]
head(X,2)
#    invoiceNo channel customer product category price       datetime quantity amount category2   cost       date   Qf    BB0
# 1:        N1      s1       c1      p1    kind1  1980 2015/1/7 20:07        1   1692      sub1 931.39 2015-01-07 15Q1 (-1,0]
# 2:        N1      s1       c1     p11    kind1  1080 2015/1/7 20:26        1    550      sub1   0.00 2015-01-07 15Q1 (-1,0]

#####===== (E3).流失客的客戶歷程(customer journey)(X-->Xlost) =====#####
Xlost = X[((X$Qf=="17Q1")&(X$BB0=="(7,30]")),];   dim(Xlost);   head(Xlost,2)   #-- [1] 1159   14
#    invoiceNo channel customer product category price        datetime quantity amount category2    cost       date   Qf    BB0
# 1:      N216      s2     c120    p248    kind2  2690  2015/1/9 15:37        1   1720      sub1 1252.46 2015-01-09 17Q1 (7,30]
# 2:      N228      s2     c120    p248    kind2  2690 2015/1/13 15:38        1   1720      sub1 1252.46 2015-01-13 17Q1 (7,30]
write.csv( Xlost, paste0(wkDir,"Xlost.csv"), fileEncoding="Big5" )

#####===== (E4).流失客客戶歷程的試解讀(Xlost$customer=="c120") =====#####
Xc120 = Xlost[which(Xlost$customer=="c120"),]
table(Xc120$channel)
#  s2 #---> 全部在s2店舖消費
# 113 
table(Xc120$category)
# kind11 kind12 kind15 kind16 kind17 kind18  kind2  kind3 kind41 kind44 
#      3      1      1      7      1      1     93      4      1      1 #---> 大多買kind2, 少部分買kind16/kind3/kind11
table(as.Date(Xc120$datetime))   
# 2015-01-09 2015-01-11 2015-01-13 2015-01-14 2015-01-15 2015-01-17 2015-01-22 2015-01-25 2015-02-04 2015-02-05 2015-02-16 2015-02-21 
#          1          1          2          1          2          1          1          2          1          1          1          2 
# ...
# 2016-11-24 2017-01-04 2017-01-06 2017-01-09 2017-01-15 2017-01-22 2017-01-23 2017-01-24 2017-01-29 2017-01-31 2017-02-08 2017-02-09 
#          1          3          3          1          1          3          1          2          3          5          2          4 
# 2017-02-15 2017-02-16 2017-02-19 2017-02-20 2017-02-22   #---> 最後來店日 2017-02-22
#          2          5          2          4          3 
table(substr(as.Date(Xc120$datetime),1,4), substr(as.Date(Xc120$datetime),6,7))
#      01 02 03 04 05 06 07 08 11
# 2015 11  6  5  9  2  0  0  1  1
# 2016 11  1  3  3  3  4  8  0  1
# 2017 22 22  0  0  0  0  0  0  0   #---> 多在上半年購物,尤其是過年期間


########## (F).各種時間標籤 ##########

#####===== (F1).日期時間的整數化 (不限,有的會以1899/12/31為起點) =====#####

##== (1) 轉為整數的日期
Cv$D0[901:910]
# [1] "2015-07-03" "2015-01-10" "2015-07-24" "2015-07-26" "2015-07-16" "2015-07-16" "2015-07-12" "2015-07-21" "2015-07-05" "2015-07-13"
AA = as.integer(as.Date(Cv$D0[901:910])); AA  #-- [1] 16619 16445 16640 16642 16632 16632 16628 16637 16621 16629
AA/365                                        #-- [1] 45.53151 45.05479 45.58904 45.59452 45.56712 45.56712 45.55616 45.58082 45.53699 45.55890
as.integer(as.Date("1970/01/01"))             #-- [1] 0   ---> 這種整數日期, 是以1970/01/01來開始計算
as.Date(AA, origin="1970/01/01")              #-- [1] "2015-07-03" "2015-01-10" "2015-07-24" "2015-07-26" "2015-07-16" "2015-07-16" "2015-07-12" "2015-07-21" "2015-07-05" "2015-07-13"

##== (2) 轉為整數的時間
X$datetime[1:5]
# [1] "2015/1/7 20:07"   "2015/1/7 20:26"   "2015/1/7 20:19"   "2015/1/28 21:28"  "2015/1/2 15:00"   
BB = as.numeric(as.POSIXct(X$datetime[1:5])); BB  #-- [1] 1420632420 1420633560 1420633140 1422451680 1420182000 
BB/(86400*365)                                    #-- [1] 45.04796 45.04799 45.04798 45.10565 45.03368 
as.POSIXct(BB, origin = '1970-01-11 00:00:00')    #-- CST: Central Standard Time
# [1] "2015-01-17 20:07:00 CST" "2015-01-17 20:26:00 CST" "2015-01-17 20:19:00 CST" "2015-02-07 21:28:00 CST" "2015-01-12 15:00:00 CST"


#####===== (F2).日期標籤 ($season, $weekdays, $week) =====#####
##== (1) year:
substr(Cv$D0[901:910],1,4)   #--  [1] "2015" "2015" "2015" "2015" "2015" "2015" "2015" "2015" "2015" "2015"
##== (2) month:
as.integer(substr(Cv$D0[901:910],6,7))    #-- [1] 7 1 7 7 7 7 7 7 7 7
##== (3) day:
as.integer(substr(Cv$D0[901:910],9,10))   #-- [1]  3 10 24 26 16 16 12 21  5 13
##== (4) weekdays:
library(lubridate)
weekdays(as.Date(Cv$D0)[901:910])   #-- [1] "星期五" "星期六" "星期五" "星期日" "星期四" "星期四" "星期日" "星期二" "星期日" "星期一"

####== (A) 年月與週次的運用 ==####
table(substr(Cv$D0,1,7), weekdays(as.Date(Cv$D0)))
#         星期一 星期二 星期三 星期五 星期六 星期日 星期四
# 2015-01     37     39     36     66     87     72     55
# 2015-02     55     37     50     39     77     64     40
# 2015-03     37     31     39     33     63     78     17
# ...
# 2017-10     47     43     36     35     45     66     37
# 2017-11     25     15     34     17     44     66     25
# 2017-12     34     22     29     41     51     52     24   #---> 週六新客最多,其次是週日
round( 100*addmargins( prop.table(table(substr(Cv$D0,1,7), weekdays(as.Date(Cv$D0))), margin=1), margin=2), 1 )
#         星期一 星期二 星期三 星期五 星期六 星期日 星期四   Sum
# 2015-01    9.4    9.9    9.2   16.8   22.2   18.4   14.0 100.0
# 2015-02   15.2   10.2   13.8   10.8   21.3   17.7   11.0 100.0   #---> 週六+週日的新客,約有四成

##== (5) week:
weeks = as.integer( (as.Date(X$datetime)-as.Date("2015-01-01"))/7 )

####== (B) 月週的運用 ==####
table(as.integer(weeks))   #---> 似乎每4-5週會有個小高峰週期
#   0    1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18   19   20   21   22   23   24   25   26 
# 485* 418  373  366  551  678 1034* 985  547  406  443* 366  342  505* 340  414  383  449  455* 402  367  391  382  432  463* 425  408 
#  27   28   29   30   31   32   33   34   35   36   37   38   39   40   41   42   43   44   45   46   47   48   49   50   51   52   53 
# 374  421  557* 492  401  419  500  551  622* 602  565  473  330  315+ 379  419  429  435  447* 404  367  391  442* 386  372  408  359 
#  54   55   56   57   58   59   60   61   62   63   64   65   66   67   68   69   70   71   72   73   74   75   76   77   78   79   80 
# 403  489  662 1016  701  424  512  366  399  329  368  432  321  372  330  298  531  489  445  484  476  459  370  353  435  323  380 
#  81   82   83   84   85   86   87   88   89   90   91   92   93   94   95   96   97   98   99  100  101  102  103  104  105  106  107 
# 717  546  565  552  363  348  427  460  376  412  394  385  435  304  414  401  482  372  400  334  387  372  532  442  327  440  540 
# 108  109  110  111  112  113  114  115  116  117  118  119  120  121  122  123  124  125  126  127  128  129  130  131  132  133  134 
# 824  455  399  278  305  281  267  300  336  383  325  320  426  498  455  439  330  436  333  281  303  418  832 1105  978 1364 1004 
#  135  136  137  138  139  140  141  142  143  144  145  146  147  148  149  150  151  152  153  154  155  156 
# 1855 1207 1022 1328 1092 1200 1178  973  899 1164  780  892  853  911  957  721  762  754  940  795  850  636 
plot(table(as.integer(weeks)))

#####===== (F3).時間標籤 ($hour, $minute) =====#####
hour(X$datetime)[1:10]   #--  [1] 20 20 20 21 15 12 13 18 18 18
####== (C) 週時的運用 ==####
table( hour(X$datetime), weekdays(as.Date(X$datetime)))
#    星期一 星期二 星期三 星期五 星期六 星期日 星期四
# 0       0      2      0      0      0      0      0
# 10      5      2      5      2      1      4      2
# 11    175    137    163    135    227    338    148
# 12    634    569    490    649    920    882    443
# 13    712    679    669    760   1113   1358    693
# 14    849    659    704    849   1350   1608    684
# 15    736    726    714    951   1288   1619    763
# 16    869    813    785   1018   1376   1595    863
# 17    937    972    949   1064   1396   1582    870
# 18    991    966    930   1081   1318   1468    852
# 19   1242   1049   1111   1110   1649   1767   1037
# 20   1602   1600   1610   1805   1928   2276   1567   #---> 人潮(其實X不是人潮,是交易貨品數)最多是在晚上8點
# 21   1660   1592   1393   1699   2087   2078   1380   #---> 週六則是晚上9點
# 22    321    274    383    489    466    356    348   #---> 應該還可以分不同店舖(channel)的不同人潮
# 23      7      6      1      0      1      2      0


########## (G).R中的數據編碼 ##########

#####===== (G1).編碼種類 =====#####
iconvlist()
# [1] "437"                     "850"                     "852"                     "855"                    
# [5] "857"                     "860"                     "861"                     "862"                    
# [9] "863"                     "865"                     "866"                     "869"                    
# [13] "ANSI_X3.4-1968"          "ANSI_X3.4-1986"          "ASCII"                   "ASMO-708"               
# [17] "BIG-5"                   "BIG-FIVE"                "big5"                    "BIG5" 
# ...
# [365] "x-mac-greek"             "x-mac-hebrew"            "x-mac-icelandic"         "x-mac-japanese"         
# [369] "x-mac-korean"            "x-mac-romanian"          "x-mac-thai"              "x-mac-turkish"          
# [373] "x-mac-ukrainian"         "x_Chinese-Eten"  

#####===== (G2).編碼轉換 =====#####
PP = "hello";   QQ = iconv(PP,"UTF8","BIG5");  QQ   #-- [1] "hello"
PP = "實驗";    QQ = iconv(PP,"UTF8","BIG5");  QQ   #-- [1] NA   **1
PP = "實驗";    QQ = iconv(PP,"BIG5","UTF8");  QQ   #-- [1] "實驗"
iconv(QQ,"UTF8","BIG5")      #-- [1] "實驗"  **2  ---> 尚無法解釋: 為什麼**1不行,但**2可以?
###---> 通常對於編碼不對的檔案,可以各種(374種)編碼間,相互編碼轉換,來實驗

#####===== (G2)安裝軟件包的路徑 =====#####
##== 在Windows中,軟件包安裝路徑若有中文,會產生錯誤
##== 可觀察預設的軟件包安裝路徑
.libPaths()
##== 並修改軟件包安裝路徑到沒有中文碼的路徑
.libPaths("c:/Users/...")

